/*
 Лятно облекло
Лято е с много променливо време и Виктор има нужда от вашата помощ. Напишете програма която спрямо времето от денонощието и градусите да препоръча на Виктор какви дрехи да си облече. Вашия приятел има различни планове за всеки етап от деня, които изискват и различен външен вид, тях може да видите от таблицата.
От конзолата се четат точно два реда:
⦁	Градусите - цяло число в интервала [10…42]
⦁	Текст, време от денонощието - с възможности - "Morning", "Afternoon", "Evening"

!!!!! Таблицата е в файла с задачи -> 

Да се отпечата на конзолата на един ред: "It's {градуси} degrees, get your {облекло} and {обувки}."

 */

using System;


namespace _47.Summer_Outfit
{
    internal class SummerOutfit
    {
        static void Main(string[] args)
        {
        }
    }
}
