/*
 ⦁	Зоомагазин
Напишете програма, която пресмята нужните разходи за закупуването на храна за кучета и котки.
Храната се пазарува от зоомагазин, като една опаковка храна за кучета е на цена 2.50 лв, а опаковка храна за котки струва 4 лв.
Вход
От конзолата се четат 2 реда:
⦁	Броят на опаковките храна за кучета – цяло число в интервала [0… 100]
⦁	Броят на опаковките храна за котки –  цяло число в интервала [0… 100]
Изход
На конзолата се отпечатва: 
"{крайната сума} lv."

 */

using System;


namespace _17.Pet_Shop
{
    internal class PetShop
    {
        static void Main(string[] args)
        {
            double a = int.Parse(Console.ReadLine()) * 2.50;
            int b = int.Parse(Console.ReadLine()) * 4;
            Console.WriteLine($"{a + b} lv.");
            Console.ReadLine();
        }
    }
}
