/*
 ⦁	Сума от две числа
Напишете програма която проверява всички възможни комбинации от двойка числа в интервала от две дадени числа.
На изхода се отпечатва, коя поред е комбинацията чиито сбор от числата е равен на дадено магическо число.
Ако няма нито една комбинация отговаряща на условието се отпечатва съобщение, че не е намерено.
Вход
Входът се чете от конзолата и се състои от три реда:
⦁	Първи ред – начало на интервала – цяло число в интервала [1...999]
⦁	Втори ред – край на интервала – цяло число в интервала [по-голямо от първото число...1000]
⦁	Трети ред – магическото число – цяло число в интервала [1...10000]
Изход
На конзолата трябва да се отпечата един ред, според резултата:
⦁	Ако е намерена комбинация чиито сбор на числата е равен на магическото число
⦁	"Combination N:{пореден номер} ({първото число} + {второ число} = {магическото число})"
⦁	Ако не е намерена комбинация отговаряща на условието
⦁	"{броят на всички комбинации} combinations - neither equals {магическото число}"

 
 */


using System;


namespace _91.Sum_of_Two_Numbers
{
    internal class SumOfTwoNumbers
    {
        static void Main(string[] args)
        {
            int min = int.Parse(Console.ReadLine());
            int max = int.Parse(Console.ReadLine());
            int m = int.Parse(Console.ReadLine());
            int count = 0;
            bool found = false;
            for (int i = min; i <= max; i++)
            {
                for(int j = min; j <= max; j++)
                { 
                    count++;
                    if(i + j == m) { Console.WriteLine($"Combination N:{count} ({i} + {j} = {m})"); found = true; break; }
                }
                if(found) { break; }
            }
            if(!found) Console.WriteLine($"{count} combinations - neither equals {m}");
        }
    }
}
