

/*
 ⦁	Специални числа
Да се напише програма, която чете едно цяло число N, въведено от потребителя, и генерира всички възможни "специални" числа от 1111 до 9999.
За да бъде "специалнo" едно число, то трябва да отговаря на следното условие: 
⦁	N да се дели на всяка една от неговите цифри без остатък.
Пример: при N = 16, 2418 е специално число:
⦁	16 / 2 = 8 без остатък
⦁	16 / 4 = 4 без остатък
⦁	16 / 1 = 16 без остатък
⦁	16 / 8 = 2 без остатък
Вход
Входът се чете от конзолата и се състои от едно цяло число в интервала [1…600000]
Изход
На конзолата трябва да се отпечатат всички "специални" числа, разделени с интервал

 
 */

using System;



namespace _98.Special_Numbers
{
    internal class SpecialNumbers
    {
        static void Main(string[] args)
        {
            int n = int.Parse(Console.ReadLine());
            int count = 0;
            for(int i = 1111; i <= 9999; i++)
            {
                count = 0;
                for (int d = 10; d <= 10000; d *= 10)
                {
                    int digit;
                    if (d == 10) { 
                        digit = i % d;
                        if (digit != 0 && n % digit == 0) { count++; }
                        else { break; }
                    }
                    else { 
                        digit = (i % d) / (d / 10);
                        if (digit != 0 && n % digit == 0) { count++; } 
                        else { break; }
                    }
                    
                }
                if (count == 4) { Console.Write(i + " "); }
            }
        }
    }
}
