/*
 ⦁	Бонус точки
Дадено е цяло число – начален брой точки. Върху него се начисляват бонус точки по правилата, описани по-долу.
Да се напише програма, която пресмята бонус точките, които получава числото и общия брой точки (числото + бонуса).
⦁	Ако числото е до 100 включително, бонус точките са 5.
⦁	Ако числото е по-голямо от 100, бонус точките са 20% от числото.
⦁	Ако числото е по-голямо от 1000, бонус точките са 10% от числото.

⦁	Допълнителни бонус точки (начисляват се отделно от предходните):
⦁	За четно число  + 1 т.
⦁	За число, което завършва на 5  + 2 т.

 */


using System;


namespace _27.Bonus_Score
{
    internal class BonusScore
    {
        static void Main(string[] args)
        {
            double a = double.Parse(Console.ReadLine()), b = 0.0;
            if (a <= 100) { b += 5; }
            else if (a > 1000 ) { b += a * 0.1; }
            else { b += a * 0.2; }
            if (a % 2 == 0) { b ++; }
            if (a % 10 == 5) { b += 2; }
            Console.WriteLine(b);
            Console.WriteLine(a + b);
        }
    }
}
